# CreateMaterial

```pascal
FUNCTION CreateMaterial(
				name             : STRING;
				isSimpleMaterial : BOOLEAN): HANDLE;
```

```python
def vs.CreateMaterial(name, isSimpleMaterial):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|name|STRING|   |
|isSimpleMaterial|BOOLEAN|   |

## Version
Availability: from Vectorworks 2021

## Category
* Object Attributes